# RebarShapeHookRotationAtStart Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarShapeHookRotationAtStart Property
ParameterTypeId Class See Also
---
"Hook Rotation At Start"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarShapeHookRotationAtStart { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarShapeHookRotationAtStart As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarShapeHookRotationAtStart {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace